"""
🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 

                        █▀█ █▀▀ █▀▀ █░█ █░░ ▄▀█ █▀█   █▀▀ ▀▄▀ █▀█ █▀█ █▀▀ █▀ █▀ █ █▀█ █▄░█ █▀
                        █▀▄ ██▄ █▄█ █▄█ █▄▄ █▀█ █▀▄   ██▄ █░█ █▀▀ █▀▄ ██▄ ▄█ ▄█ █ █▄█ █░▀█ ▄█

                                    ⣿⣿⣿⣿⣿⣿⠟⠋⠁⣀⣤⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣿
                                    ⣿⣿⣿⣿⠋⠁⠀⠀⠺⠿⢿⣿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠻⣿
                                    ⣿⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⣤⣤⣤⠀⠀⠀⠀⠀⣤⣦⣄⠀⠀
                                    ⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣶⣿⠏⣿⣿⣿⣿⣿⣁⠀⠀⠀⠛⠙⠛⠋⠀⠀
                                    ⡿⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⣰⣿⣿⣿⣿⡄⠘⣿⣿⣿⣿⣷⠄⠀⠀⠀⠀⠀⠀⠀⠀
                                    ⡇⠀⠀⠀⠀⠀⠀⠀⠸⠇⣼⣿⣿⣿⣿⣿⣷⣄⠘⢿⣿⣿⣿⣅⠀⠀⠀⠀⠀⠀⠀⠀
                                    ⠁⠀⠀⠀⣴⣿⠀⣐⣣⣸⣿⣿⣿⣿⣿⠟⠛⠛⠀⠌⠻⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀
                                    ⠀⠀⠀⣶⣮⣽⣰⣿⡿⢿⣿⣿⣿⣿⣿⡀⢿⣤⠄⢠⣄⢹⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀
                                    ⠀⠀⠀⣿⣿⣿⣿⣿⡘⣿⣿⣿⣿⣿⣿⠿⣶⣶⣾⣿⣿⡆⢻⣿⣿⠃⢠⠖⠛⣛⣷⠀
                                    ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣾⣿⣿⣿⣿⣿⣿⣮⣝⡻⠿⠿⢃⣄⣭⡟⢀⡎⣰⡶⣪⣿⠀
                                    ⠀⠀⠘⣿⣿⣿⠟⣛⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣿⣿⣿⡿⢁⣾⣿⢿⣿⣿⠏⠀
                                    ⠀⠀⠀⣻⣿⡟⠘⠿⠿⠎⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣵⣿⣿⠧⣷⠟⠁⠀⠀
                                    ⡇⠀⠀⢹⣿⡧⠀⡀⠀⣀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠋⢰⣿⠀⠀⠀⠀
                                    ⡇⠀⠀⠀⢻⢰⣿⣶⣿⡿⠿⢂⣿⣿⣿⣿⣿⣿⣿⢿⣻⣿⣿⣿⡏⠀⠀⠁⠀⠀⠀⠀
                                    ⣷⠀⠀⠀⠀⠈⠿⠟⣁⣴⣾⣿⣿⠿⠿⣛⣋⣥⣶⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀ ⣿⡀
                                        
                                    丂ㄖㄩ尺⼕🝗 ⼕ㄖᗪ🝗 ⻏丫 Ꮆ🝗𝓝🝗丂讠丂Ꮆ讠尺

further in depth studies on regexes

🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 
"""

# import modules
import re, random, sys

# search method
def searchforpattern():
    """ # searchforpattern()
    searchforpattern()
    
    """
    # regex globals
    global greedy_regex
    global non_greedy_regex
    global matches
    global genesis_case_insensitive_regex_
    global subsitute_regex_
    global verbose_thicc_waifu_thot_regex
    global time_regex
    global date_regex
    
    # regex array
    regex = [greedy_regex, non_greedy_regex, genesis_case_insensitive_regex_, subsitute_regex_, time_regex, date_regex]
    
    # storing pattren objects into matches
    matches = re.compile(date_regex) # regex algorithm to use
    
    # values are in str 
    data = '3/11/2023'

    # display regex results
    #print(matches.match(data))
    #print(matches.search(data))
    #print(matches.findall(data))
    
    # case insensitive matching
    #print('case insensitive matching:')
    #print(matches.search(data))
    
    # subsitute matching
    #name_generator = ['waifu ','destroyer of worlds ', 'facefucker ']
    #
    #print('subsitute regex matching:')
    #print(matches.search(data))
    
    # mitigate verbose regexes w/re.VERBOSE method
    #print(matches.match(data))
    
    # combining multiple re methods
    return print(date_regex.match(data))


""" <- regex symbol guide
🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂 𝖘𝖙𝖚𝖉𝖎𝖊𝖘

╭━━━╮╱╱╱╱╱╱╱╱╱╱╱╱╭━━━╮╱╱╱╱╱╱╭╮╱╱╱╱╭╮
┃╭━╮┃╱╱╱╱╱╱╱╱╱╱╱╱┃╭━╮┃╱╱╱╱╱╱┃┃╱╱╱╱┃┃
┃╰━╯┣━━┳━━┳━━┳╮╭╮┃╰━━┳╮╱╭┳╮╭┫╰━┳━━┫┃╭━━╮
┃╭╮╭┫┃━┫╭╮┃┃━╋╋╋╯╰━━╮┃┃╱┃┃╰╯┃╭╮┃╭╮┃┃┃━━┫
┃┃┃╰┫┃━┫╰╯┃┃━╋╋╋╮┃╰━╯┃╰━╯┃┃┃┃╰╯┃╰╯┃╰╋━━┃
╰╯╰━┻━━┻━╮┣━━┻╯╰╯╰━━━┻━╮╭┻┻┻┻━━┻━━┻━┻━━╯
╱╱╱╱╱╱╱╭━╯┃╱╱╱╱╱╱╱╱╱╱╭━╯┃
╱╱╱╱╱╱╱╰━━╯╱╱╱╱╱╱╱╱╱╱╰━━╯

▟▛ ▚▘ ▛▟ ██ ▛ ▟▛ █ ▟▛ 

⣿⣿⣿⣿⣯⣿⣿⠄⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠈⣿⣿⣿⣿⣿⣿⣆⠄
⢻⣿⣿⣿⣾⣿⢿⣢⣞⣿⣿⣿⣿⣷⣶⣿⣯⣟⣿⢿⡇⢃⢻⣿⣿⣿⣿⣿⢿⡄
⠄⢿⣿⣯⣏⣿⣿⣿⡟⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣧⣾⢿⣮⣿⣿⣿⣿⣾⣷
⠄⣈⣽⢾⣿⣿⣿⣟⣄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣝⣯⢿⣿⣿⣿⣿
⣿⠟⣫⢸⣿⢿⣿⣾⣿⢿⣿⣿⢻⣿⣿⣿⢿⣿⣿⣿⢸⣿⣼⣿⣿⣿⣿⣿⣿⣿
⡟⢸⣟⢸⣿⠸⣷⣝⢻⠘⣿⣿⢸⢿⣿⣿⠄⣿⣿⣿⡆⢿⣿⣼⣿⣿⣿⣿⢹⣿
⡇⣿⡿⣿⣿⢟⠛⠛⠿⡢⢻⣿⣾⣞⣿⡏⠖⢸⣿⢣⣷⡸⣇⣿⣿⣿⢼⡿⣿⣿
⣡⢿⡷⣿⣿⣾⣿⣷⣶⣮⣄⣿⣏⣸⣻⣃⠭⠄⠛⠙⠛⠳⠋⣿⣿⣇⠙⣿⢸⣿
⠫⣿⣧⣿⣿⣿⣿⣿⣿⣿⣿⣿⠻⣿⣾⣿⣿⣿⣿⣿⣿⣿⣷⣿⣿⣹⢷⣿⡼⠋                          𝕣𝕖𝕘𝕖𝕩𝕖𝕤 𝕤𝕥𝕒𝕟𝕕 𝕗𝕠𝕣 𝕣𝕖𝕘𝕦𝕝𝕒𝕣 𝕖𝕩𝕡𝕣𝕖𝕤𝕤𝕚𝕠𝕟𝕤
⠄⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣿⣿⣿⠄⠄
⠄⠄⢻⢹⣿⠸⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣼⣿⣿⣿⣿⡟⠄⠄                      ᵗʰᵉʳᵉ ᵃʳᵉ ᵃ ˢᵉᵗ ᵒᶠ ˢʸᵐᵇᵒˡˢ ʸᵒᵘ ᶜᵃⁿ ᵘˢᵉ ᵃˢ ʷᵉˡˡ
⠄⠄⠈⢸⣿⠄⠙⢿⣿⣿⣹⣿⣿⣿⣿⣟⡃⣽⣿⣿⡟⠁⣿⣿⢻⣿⣿⢿⠄⠄
⠄⠄⠄⠘⣿⡄⠄⠄⠙⢿⣿⣿⣾⣿⣷⣿⣿⣿⠟⠁⠄⠄⣿⣿⣾⣿⡟⣿⠄⠄                      geͤneͤs͛iͥs͛ loͦvͮeͤs͛ ᴛⷮoͦ iͥmͫрⷬleͤmͫeͤnᴛⷮ ᴛⷮhͪeͤmͫ yoͦuͧ s͛hͪoͦuͧldͩ ᴛⷮoͦoͦ
⠄⠄⠄⠄⢻⡇⠸⣆⠄⠄⠈⠻⣿⡿⠿⠛⠉⠄⠄⠄⠄⢸⣿⣇⣿⣿⢿⣿⠄⠄

The ? matches zero or one of the preceding group.
The * matches zero or more of the preceding group.
The + matches one or more of the preceding group.
The {n} matches exactly n of the preceding group.
The {n,} matches n or more of the preceding group.
The {,m} matches 0 to m of the preceding group.
The {n,m} matches at least n and at most m of the preceding group.
{n,m}? or *? or +? performs a non-greedy match of the preceding group.
^spam means the string must begin with spam.
spam$ means the string must end with spam.
The . matches any character, except newline characters.
\d, \w, and \s match a digit, word, or space character, respectively.
\D, \W, and \S match anything except a digit, word, or space character, respectively.
[abc] matches any character between the brackets (such as a, b, or c).
[^abc] matches any character that isn’t between the brackets.
🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂 
"""

# regex patterns
email_regex = re.compile(r'^([a-zA-Z0-9\-_])@{1}([a-zA-Z0-9\-_]).{1}([a-zA-Z0-9\-_]){2 ,3}$')
security_pin_code_regex = re.compile(r'^(\d{6})$')
username_regex = re.compile(r'^(\w{3,12})$')
social_secruity_regex = re.compile(r'^(\d{3})(-)?(\d{2})(-)?(\d{4})$')
name_regex = re.compile(r'^\w(0, 12)+$')
mobile_pin_regex = re.compile(r'^(\d{4})$')
password_regex = re.compile(r'^([a-zA-Z0-9\-_])+$')
full_name_regex = re.compile(r'^([a-zA-Z]+)(\s),*([a-zA-Z]*)?(\s)*([a-zA-Z]+)?$')
time_regex = re.compile(r'^(\d{1,2}):(\d{1,2})(\s)?[AaPp][Mm]$')
date_regex = re.compile(r'^(\d{1,2})[\-\.\/]{1}(\d{1,2})[\-\.\/]{1}(\d{4})$')

#verbose_thicc_waifu_thot_regex = re.compile(r'''(^
#  
#  (THICC) # THICC words
#  (waifu)  # waifu words
#  (THOT)    # THOT words
#  \d\d\d      # 3-digits
#  \w\w\w        # 3 letters
#  .{3}            # 3 dots/periods
#  @{3}              #  at symbols
#                                  $)''', re.VERBOSE)

""" <- GenesisGir re.VERBOSE tips! 
🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  


                                █▀█ █▀▀ ░ █░█ █▀▀ █▀█ █▄▄ █▀█ █▀ █▀▀
                                █▀▄ ██▄ ▄ ▀▄▀ ██▄ █▀▄ █▄█ █▄█ ▄█ ██▄
                                
                            
                                              _______                        
                                            /:.::::.\ ____                  
                                        _.-O:::::::::O::::\_                     _
                                      /..:::-___ ::::.:::::\                    \\
                                    |:..::::::::::::..::::;'                  __\\___
                                      |...|,|,,;;;,|,|..:::::'                 `---..--'
                                      ||.🅶🅴🅽🅴🆂🅸🆂|...:::;/                    __\\___
                                        \.|   .    |...:;/                      `---..--'
                                        ``\_ . _ /;;::/                             \\
                                      _.-'/\ `-'  |\ ''`--------.___                  `'
                                    _/  \ \.|\.--'|.| |/.           \_          _  _   _
                                 _/    |.|:| |\  /./ :.        /     \         \\ \\ //
                                _/      :. \:\`` |./  |___,----'--._   \         `  `//
                              /  __   .\.  \:\  /.|  /             \__=\        ___//
                              |.    `- /|.   \_\/_/  /                /  |      `---'
                              |.      `-;____  Q|:   '\               \;_/       _______
                              \___     /    \  |__    \                        /,---- /
                                  `---|-_,,,' Q|       \                      //    //
                                     _|.       |     _/-`-._                  `    //
                                  ,-'. \__    /.\___/.\__  \`-.                   //
                                _/:.._/./.\__/. /.\. \   \.  \.\             ____//
                                /:. _/. /.  |.  |.  |. |.  \.  \_\            `---'
                              /:. /.. |.  |.   |.  |. |.   \    \|               _
                              |:. /.. |.   |.   |.  |.   |.  \.  ||              |_|
                              |. /.. |.   |.    |.  |    |.   |. ./        
                              | |..  |.   |.    |.   |.   |.  |..|                 ,.
                              \|.. |.   |..    |    |    |   |_/              ____||__
                                \.  |.   |.     |.   |.   |.  /               `----..--'
                                \_ /.   |.     |.   |.   |._/                    /,|
                                  \__.  |..    |.   |. __,/                     //||
                                     `----.___,--._,--'                        // ||
                                        \\===: |    |                        `'  `'
                                          `---' |    |                        _______
                                                |    |                       `------.|
                                                | __ |                              ||
                                                |'  :'                              //
                                          ......|   |......                        //
                                      .....:.:. |   |.:........               ____//
                                    ...:..:.:.. |   |..:...:.....             `---'
                                      ...:......... |_  |.:.:..........       
                                  ..:...:.:.... /==\-|..:.:..:.:.....      
                                  .....:.....:. \===\|.:.:...........      
                                  .......:...... |===/..:...:....:.:.       
                                  :.......:.... |==/ .:............       
                                    ..:.........`--'..........            
                                      .......:.......:.                   
                                            ..........                    
                            
                                      𝔾𝔼ℕ𝔼𝕊𝕀𝕊 𝕊𝕐ℕ𝕆ℙ𝕊𝕀𝕊


're.VERBOSE' is a function from the 're' module that allows you to mitigate complex verbose regexes/regular expressions and format
them more cleanly! This is great if your regex is becoming more intricate as you code deeper into projects and scripts and is handy
to know how to implement and here's how.

e.g complex regex that needs some VERBOSE
example_regex = re.compile(r'^(\d\d\d\d\d\d\d\d\d\d)+(\w\w\w\w\w\w\w\w\w\w)+(\D\W\d\d\W)+(GenesisGir){1}(VERBOSE){1}$')

On the surface this looks fine and to many beginners this would be quite enough but there are other alternitives and ways to make this look
more readable in the aspect of regexes

e.g using re.VERBOSE

example_regex = re.compile(r'''(
  
  # regex pattern
  ^
  (\d\d\d\d\d\d\d\d\d\d)+ # accept 10-digits
  (\w\w\w\w\w\w\w\w\w\w)+ # accept 10=letters 
  (\D\W\d\d\W)+ # accept 1 digit, 1 letter, 2 digit than another letter
  (GenesisGir){1} # except the text value 'GenesisGir' case sensitive (1) time's
  (VERBOSE){1} # expect the text values 'VERBOSE' case sensitive  (1) time's
  $
  )''')

As you can see the code above in the example e.g 2 is way more easier to read and does not trail off it it was even more complex 
than it is right now, Which is why you should consider using re.VERBOSE at the end of your defined regexes. Simple, Clean, Formatation.

🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂  🅶🅴🅽🅴🆂🅸🆂 
"""

# greedy non-greedy regexes
greedy_regex = re.compile(r'(name: <.*>)')
non_greedy_regex = re.compile(r'^(name: <.?>)$')

# case insensitive regex
genesis_case_insensitive_regex_ = re.compile(r'(GeNeSiS)', re.I)

""" <- case sensitive regex guide
                    █▀▀ ▄▀█ █▀ █▀▀   █ █▄░█ █▀ █▀▀ █▄░█ █▀ █ ▀█▀ █ █░█ █▀▀   █▀█ █▀▀ █▀▀ █▀▀ ▀▄▀
                    █▄▄ █▀█ ▄█ ██▄   █ █░▀█ ▄█ ██▄ █░▀█ ▄█ █ ░█░ █ ▀▄▀ ██▄   █▀▄ ██▄ █▄█ ██▄ █░█

  ⣿ ⢹ ⣿ ⣿   ⣿ ⢹⣿  ⢸⣿ ⣿⣿   ⣿    ⣿ ⢹ ⣿ ⣿⣿⣿    ⣿  ⢿⣿⡇⡇⣿⣿⡇⢹⣿⣿⣿⣿⣿⣿      ⠄⢸ ⣿  ⣿ ⢹ ⣿ ⣿ ⣿ ⢹ ⣿ ⣿  ⣿ ⢹ ⣿ ⣿ ⣿ ⢹ ⣿ ⣿ ⣿ ⢹ ⣿ ⣿ 
                                                      ⡟⢸⣿⣿⣭⣭⡭
                                            ╭━━━┳━━━┳━╮╱╭┳━━━┳━━━┳━━┳━━━╮
                                            ┃╭━╮┃╭━━┫┃╰╮┃┃╭━━┫╭━╮┣┫┣┫╭━╮┃
                                            ┃┃╱╰┫╰━━┫╭╮╰╯┃╰━━┫╰━━╮┃┃┃╰━━╮
                                            ┃┃╭━┫╭━━┫┃╰╮┃┃╭━━┻━━╮┃┃┃╰━━╮┃
                                            ┃╰┻━┃╰━━┫┃╱┃┃┃╰━━┫╰━╯┣┫┣┫╰━╯┃
                                            ╰━━━┻━━━┻╯╱╰━┻━━━┻━━━┻━━┻━━━╯
                                            ⣼⣶⣿⣿⣿⣿⢸⣧⣇⠇⢸⣿⣿⠈⣿⣿⣿⣿⣿⣿⡆⠘⣿
                                      ⡇⢸⣿⣿⣿⣿⡇⣻⡿⣿⣿⡟⣿⢸⣿⣿⠇⡆⣝⠿⡌⣸⣿⣿⣿⣿⣿⡇⠄⣿
                                      ⢣⢾⣾⣷⣾⣽⣻⣿⣇⣿⣿⣧⣿⢸⣿⣿⡆⢸⣹⣿⣆⢥⢛⡿⣿⣿⣿⡇⠄⣿
                                      ⣛⡓⣉⠉⠙⠻⢿⣿⣿⣟⣻⠿⣹⡏⣿⣿⣧⢸⣧⣿⣿⣨⡟⣿⣿⣿⣿⡇⠄⣿
                                      ⠸⣷⣹⣿⠄⠄⠄⠄⠘⢿⣿⣿⣯⣳⣿⣭⣽⢼⣿⣜⣿⣇⣷⡹⣿⣿⣿⠁⢰⣿
                                      ⠄⢻⣷⣿⡄⢈⠿⠇⢸⣿⣿⣿⣿⣿⣿⣟⠛⠲⢯⣿⣒⡾⣼⣷⡹⣿⣿⠄⣼⣿
                                      ⡄⢸⣿⣿⣷⣬⣽⣯⣾⣿⣿⣿⣿⣿⣿⣿⣿⡀⠄⢀⠉⠙⠛⠛⠳⠽⠿⢠⣿⣿
                                      ⡇⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⢄⣹⡿⠃⠄⠄⣰⠎⡈⣾⣿⣿
                                      ⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⣭⣽⣖⣄⣴⣯⣾⢷⣿⣿⣿
                                      ⣧⠸⣿⣿⣿⣿⣿⣿⠯⠊⠙⢻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⣾⣿⣿⣿
                                      ⣿⣦⠹⣿⣿⣿⣿⣿⠄⢀⣴⢾⣼⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣾⣿⣿⣿⣿
                                      ⣿⣿⣇⢽⣿⣿⣿⡏⣿⣿⣿⣿⣿⡇⣿⣿⣿⣿⡿⣿⣛⣻⠿⣟⣼⣿⣿⣿⣿⢃
                                      ⣿⣿⣿⡎⣷⣽⠻⣇⣿⣿⣿⡿⣟⣵⣿⣟⣽⣾⣿⣿⣿⣿⢯⣾⣿⣿⣿⠟⠱⡟
                                      ⣿⣿⣿⣿⢹⣿⣿⢮⣚⡛⠒⠛⢛⣋⣶⣿⣿⣿⣿⣿⣟⣱⠿⣿⣿⠟⣡⣺⢿
                                      
                                      
                                            ▟▛ ▚▘ ▛▟ ██ ▛ ▟▛ █ ▟▛ 


regexes can be case specific if set but did you know you can skip that all with one method with 're.I' make sure you have 're' module imported
into your script/module than follow the following example

                        x - - - - - - G - E - N - E - S - I - S - - - - - - - - - - - - - - - - x

                        e.g with re.I
                        case_insensitive_regex = re.compile(r'(Case)', re.I)

                        x - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - x

              This regular experession is now not case sensitive and makes for more faster easier to read code.


                        x - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - x

                        e.g without re.I
                        case_sensitive_regex = re.compile(r'(Case)')

            This regular expression is case senstive and the 'Case' must be written with a capital 'C', If you aim to 
            make regexes case sensitive than this route is fine but if you'd like to make them case insensitive use t
            he first example with 're.I'

                        x - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - x
"""

# subsitute regex
subsitute_regex_ = re.compile(r'^(genesis) (\w*).' , re.I)

# combing re.VERBOSE, re.IGNORECASE, re.DOTALL
#combine_re_method_regex = re.compile(r'''(
#  
#  (\d\d\d)* # 3-digits
#  (genesisgir) # expect genesisgir as text value within pattern 
#  ()
#  \d)''', re.IGNORECASE | re.VERBOSE | re.DOTALL)

# zaion exam regex
#z_pattern = re.compile(r'''(
#  
#  # z patterns
#  ([a-zA-Z0-9\-_]+)@{1}([a-zA-Z]+).{1}([a-zA-Z]+{3}) # email pattern
#  (\d{3})*(-)?(\d{3})+(-)?(\d{4})+ # phone number pattern
#  [a-zA-Z0-9\-_]+{8, 99} # password pattern case insensitive , char limit (8, 99)
#  )''', re.VERBOSE | re.IGNORECASE)

# genesisgir's regex desired by my mentor!
z_pattern = re.compile(r'''

^ # search for match at start of (str)
([a-zA-Z0-9\-_])+@{1}([a-zA-Z])+.{1}([a-zA-Z]{2, 3})+ # email pattern
(\d{3})-(\d{3})-(\d{4})-(\d{2})? # phone number pattern
([a-zA-Z0-9\-_])+ # password pattern
$ # search for matches at the end of str also

''', re.IGNORECASE | re.VERBOSE | re.DOTALL)

# print matches w/function 
searchforpattern()