# < - create a logger or use one of mine and place here
"""𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖙𝖜𝖎𝖙𝖈𝖍./𝖙𝖊𝖓𝖓𝖎𝖘𝖜𝖆𝖎𝖋𝖚 """
"""

                            █▀▀ █▀▀ █▄░█ █▀▀ █▀ █ █▀ █▀▀ █ █▀█ █▀
                            █▄█ ██▄ █░▀█ ██▄ ▄█ █ ▄█ █▄█ █ █▀▄ ▄█
                        
                        
        ░░░░░██╗██╗░░░██╗██╗░█████╗░██╗░░░██╗  ░██████╗██╗░░░██╗░██████╗░░█████╗░██╗
        ░░░░░██║██║░░░██║██║██╔══██╗╚██╗░██╔╝  ██╔════╝██║░░░██║██╔════╝░██╔══██╗██║
        ░░░░░██║██║░░░██║██║██║░░╚═╝░╚████╔╝░  ╚█████╗░██║░░░██║██║░░██╗░██║░░██║██║
        ██╗░░██║██║░░░██║██║██║░░██╗░░╚██╔╝░░  ░╚═══██╗██║░░░██║██║░░╚██╗██║░░██║██║
        ╚█████╔╝╚██████╔╝██║╚█████╔╝░░░██║░░░  ██████╔╝╚██████╔╝╚██████╔╝╚█████╔╝██║
        ░╚════╝░░╚═════╝░╚═╝░╚════╝░░░░╚═╝░░░  ╚═════╝░░╚═════╝░░╚═════╝░░╚════╝░╚═╝
                                    
                                    
                                    █░█ █▀▀ █▄░█ ▀█▀ ▄▀█ █
                                    █▀█ ██▄ █░▀█ ░█░ █▀█ █
                                    
                                    
                                █ ▀█▀ █▀▀ █▀█ ▄▀█ ▀█▀ █▀█ █▀█
                                █ ░█░ ██▄ █▀▄ █▀█ ░█░ █▄█ █▀▄
    
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣶⣿⣟⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⣿⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⢀⣿⣿⣿⣿⣿⣿⣿⢿⣿⡇⢹⣿⣿⣿⠈⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⣼⣿⣿⣿⣿⣿⣿⡟⢸⣿⡇⠈⣿⣿⣿⠀⢧⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀
                ⢀⣿⣿⣿⣿⣿⡿⣿⣷⠸⣿⡇⠀⠹⣿⣿⣇⢈⣧⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀
                ⣸⣿⣿⣿⣿⣿⡇⣿⣾⡄⣿⡇⣀⣤⠽⣿⣿⡉⠉⢧⠻⣿⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀⠀⠀⠀⠀
                ⣿⢸⣿⣿⣿⣿⣧⣿⣿⢱⣻⡇⠀⠀⠀⠙⢻⣷⣄⣀⢳⣽⣏⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀
                ⣿⣾⣿⣿⣿⣿⡏⣿⣾⠀⠻⣧⠀⠠⢖⣫⣽⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⣿⣿⣿⣿⣿⡗⠚⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀
                ⠛⣿⣿⣿⣿⡏⣧⣿⠿⡄⠀⠘⢧⠀⠸⡿⠋⠁⠈⢿⣿⣿⠗⢷⠘⣾⣿⣿⣿⣿⣿⣿⣅⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀
                ⢸⢹⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀⠁⠀⠀⠀⠤⠦⠒⠉⠀⠀⠀⢧⠘⣿⣿⣿⣿⣿⣿⣧⠱⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢷⠀⠀⠀⠀
                ⣿⢸⣿⣿⣿⣿⣇⡈⢻⡟⠓⠤⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢧⣿⣿⣿⣿⣿⣿⡿⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⣇⠀⠀⠀
                ⡿⢸⣿⣿⣿⣿⣿⡈⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⢸⠀⠀⠀
                ⡇⠸⣿⣿⣿⣿⣿⡇⣞⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⢸⠀⠀⠀
                ⣧⠀⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢻⣿⢹⣿⣏⣾⣏⣠⡧⠤⣄⣀
                ⣿⠀⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡜⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⢻⣿⡼⠟⠸⠛⠁⠀⠀⠀⠀⠀
                ⢹⠀⢻⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⢤⣤⣤⡤⠀⠀⠀⠀⠀⠀⠀⠀⡇⣸⣿⣿⣿⣿⡟⣿⣿⣿⣿⣿⣿⣿⣯⡿⣿⣿⢃⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠈⡇⠸⣿⣿⣿⣿⣿⣿⣿⣷⣀⠀⠘⠦⠤⠄⠀⠀⠀⠀⠀⠀⠀⢰⠇⣿⣿⣿⣿⣿⡇⣿⣿⣿⣿⣿⣿⣿⡾⢡⣿⢻⡞⠁⢀⣀⣀⣀⣀⠀⠀⠀⣀⠰⠚
                ⠀⢹⠀⣿⣿⡇⣿⣿⣿⣿⣿⠟⠳⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣸⣰⣿⣿⣿⣿⣿⠀⢹⣿⡿⣿⣿⣿⠟⠁⣼⠁⣸⠚⠉⠁⠀⠀⠀⠀⣠⠴⠋⠁⠀⠀
                ⠀⠈⢳⣸⣿⡇⢻⣿⣿⣿⣿⣦⠀⢸⡷⣄⠀⠀⣀⣀⡤⢶⡋⠁⢨⢹⣿⣿⣿⣿⡇⠀⠸⣿⣧⣿⡿⠁⠀⢸⠃⢠⡇⠀⠀⠀⠀⢀⡴⠚⠁⠀⠀⠀⠀⠀
                ⠀⠀⠀⠈⣿⣇⡀⢻⣿⣿⢹⡇⠀⢸⣧⡈⠉⠉⠁⠀⠀⠀⠉⠓⢒⣿⢻⣿⣿⢷⣧⡀⢠⣷⡈⠛⠀⠀⢀⠏⢠⠏⠀⠀⠀⣠⠖⠉⠀⠀⠀⢀⣀⡤⠄⠂
                ⠀⠀⠀⠀⠸⣿⡇⠀⢻⣿⣧⢧⡐⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⢃⣿⠿⣡⡏⢹⣿⡾⠁⠀⠀⠀⠀⢸⢠⠏⠀⠀⡤⠞⠁⠀⣠⠴⠒⠋⠉⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠘⣿⠀⠀⠙⢷⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠴⠟⢁⡾⠋⣰⢿⠁⡾⠀⣧⡀⠀⠀⠀⠀⠘⡾⠀⡴⠎⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠙⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣷⡟⠀⠃⠀⡿⣿⣄⠀⠀⠀⢰⠧⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢃⡇⠀⠀⠀⣿⡜⣟⠷⢤⣀⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣏⡼⠁⢸⠇⢀⠃⡇⢸⠀⢀⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                    セ🝗⼕卄𝓝ㄖ㇄ㄖᎶ丫 讠丂 セ卄🝗 长🝗丫 七ㄖ セ🝗卄 ﾁㄩ〸ㄩ尺🝗
                            
                                
                            ╭╮╱╱╱╱╱╱╭╮╱╱╱╱╱╱╱╭╮╱╱╱╱╱╱╱╭╮╱╱╱╱╱╱╱╱╭╮
                            ┃┃╱╱╱╱╱╱┃┃╱╱╱╱╱╱╱┃┃╱╱╱╱╱╱╭╯╰╮╱╱╱╱╱╱╭╯╰╮
                            ┃╰━┳┳━━╮┃╰━┳━━┳━━┫╰━┳┳━━╮┣╮╭╋━━┳━┳━┻╮╭╋━━┳━┳━━╮
                            ┃╭╮┣┫╭╮┃┃╭╮┃╭╮┃╭╮┃╭╮┣┫┃━┫┣┫┃┃┃━┫╭┫╭╮┃┃┃╭╮┃╭┫━━┫
                            ┃╰╯┃┃╰╯┃┃╰╯┃╰╯┃╰╯┃╰╯┃┃┃━┫┃┃╰┫┃━┫┃┃╭╮┃╰┫╰╯┃┃┣━━┃
                            ╰━━┻┻━╮┃╰━━┻━━┻━━┻━━┻┻━━╯╰┻━┻━━┻╯╰╯╰┻━┻━━┻╯╰━━╯
                            ╱╱╱╱╭━╯┃
                            ╱╱╱╱╰━━╯
                                
Iterators deal with iterables and loop them determined by the integers you set and variables and this preset does it 
all and was crafted from scratch by me use it to learn from and make your on iterators and add your own twists!
    """
    
# import modules
import os, time, sys, random

# run this fucking code through a exception handler
try: # check for exceptions
    
    class Hentai: # iterator class
        
        # instant global
        global waifu
        
        # prompt/variable instant
        waifu = input("Enter the name of a waifu that you drool over please. >>> ")
        print()
        
        # iteration method
        def __iter__(self):
            
            # instants/variables for the class
            self.breast_size = 1 # birth of the integer variable 
            return self # evaluate self
            pass # do nothing essentially
            
        # traverse method
        def __next__(self): # defining the next dunder method

            # flow controls
            if self.breast_size <= 100: # if folow control statement/100 is the iteration limit
                
                # class instants
                num = self.breast_size
                
                # increase integer by 1 
                self.breast_size += 1
                return num # output final integer from the variable

            else: # int surpassed the limit resolve 
                raise StopIteration
                pass
            
            pass
    
    # obj instances/constructors
    myclass = Hentai()
    iterator = myclass
    pass # null, nill, do nothing!

    # for loop flows
    for i in iterator: # condition!
        
        print(f"{waifu}'s tiddy  size increased by {i}")
        pass
    
    # terminate program
    sys.exit()
    
except: # resolve errors
    # exception error warning alert to display to user
    print("The iter has reached its limits!")
    pass

"""𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖜𝖆𝖎𝖋𝖚 x 𝖙𝖜𝖎𝖙𝖈𝖍./𝖙𝖊𝖓𝖓𝖎𝖘𝖜𝖆𝖎𝖋𝖚 """