"""
🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 

                        █▀█ █▀▀ █▀▀ █░█ █░░ ▄▀█ █▀█   █▀▀ ▀▄▀ █▀█ █▀█ █▀▀ █▀ █▀ █ █▀█ █▄░█ █▀
                        █▀▄ ██▄ █▄█ █▄█ █▄▄ █▀█ █▀▄   ██▄ █░█ █▀▀ █▀▄ ██▄ ▄█ ▄█ █ █▄█ █░▀█ ▄█

                                    ⣿⣿⣿⣿⣿⣿⠟⠋⠁⣀⣤⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⣿
                                    ⣿⣿⣿⣿⠋⠁⠀⠀⠺⠿⢿⣿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠻⣿
                                    ⣿⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⣤⣤⣤⠀⠀⠀⠀⠀⣤⣦⣄⠀⠀
                                    ⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣶⣿⠏⣿⣿⣿⣿⣿⣁⠀⠀⠀⠛⠙⠛⠋⠀⠀
                                    ⡿⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⣰⣿⣿⣿⣿⡄⠘⣿⣿⣿⣿⣷⠄⠀⠀⠀⠀⠀⠀⠀⠀
                                    ⡇⠀⠀⠀⠀⠀⠀⠀⠸⠇⣼⣿⣿⣿⣿⣿⣷⣄⠘⢿⣿⣿⣿⣅⠀⠀⠀⠀⠀⠀⠀⠀
                                    ⠁⠀⠀⠀⣴⣿⠀⣐⣣⣸⣿⣿⣿⣿⣿⠟⠛⠛⠀⠌⠻⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀
                                    ⠀⠀⠀⣶⣮⣽⣰⣿⡿⢿⣿⣿⣿⣿⣿⡀⢿⣤⠄⢠⣄⢹⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀
                                    ⠀⠀⠀⣿⣿⣿⣿⣿⡘⣿⣿⣿⣿⣿⣿⠿⣶⣶⣾⣿⣿⡆⢻⣿⣿⠃⢠⠖⠛⣛⣷⠀
                                    ⠀⠀⢸⣿⣿⣿⣿⣿⣿⣾⣿⣿⣿⣿⣿⣿⣮⣝⡻⠿⠿⢃⣄⣭⡟⢀⡎⣰⡶⣪⣿⠀
                                    ⠀⠀⠘⣿⣿⣿⠟⣛⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣿⣿⣿⡿⢁⣾⣿⢿⣿⣿⠏⠀
                                    ⠀⠀⠀⣻⣿⡟⠘⠿⠿⠎⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣵⣿⣿⠧⣷⠟⠁⠀⠀
                                    ⡇⠀⠀⢹⣿⡧⠀⡀⠀⣀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠋⢰⣿⠀⠀⠀⠀
                                    ⡇⠀⠀⠀⢻⢰⣿⣶⣿⡿⠿⢂⣿⣿⣿⣿⣿⣿⣿⢿⣻⣿⣿⣿⡏⠀⠀⠁⠀⠀⠀⠀
                                    ⣷⠀⠀⠀⠀⠈⠿⠟⣁⣴⣾⣿⣿⠿⠿⣛⣋⣥⣶⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀ ⣿⡀

                                    丂ㄖㄩ尺⼕🝗 ⼕ㄖᗪ🝗 ⻏丫 Ꮆ🝗𝓝🝗丂讠丂Ꮆ讠尺
                    
Here is a regex that is a serial number to a mechanical device from the future that tags Individuals on the back of their necks to later 
identify them in a airport line system to see they have purchased their ticket and entry to the flights.

🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 
"""

# import modules
import re

# create regex pattern object
# TODO  create a complex regex pattern for the company ARIA
# a character limit 18 ✔
# that numeric charcters are allowed from 0-9 ✔
# letters are allowed , lowercase and capitals ✔
# special chars other than are not allowed ✔
# spaces are not allowed ✔
# underscores are not allowed ✔

''' < - serial number concept click to open
🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂

▄▀█ █▀█ █ ▄▀█   █▀ █▀▀ █▀█ █ ▄▀█ █░░   █▄░█ █░█ █▀▄▀█ █▄▄ █▀▀ █▀█   █▀█ █▀▀ █▀▀
█▀█ █▀▄ █ █▀█   ▄█ ██▄ █▀▄ █ █▀█ █▄▄   █░▀█ █▄█ █░▀░█ █▄█ ██▄ █▀▄   █▀▄ ██▄ █▀░

                    ░░░████▌█████▌█░████████▐▀██▀
                    ░▄█████░█████▌░█░▀██████▌█▄▄▀▄
                    ░▌███▌█░▐███▌▌░░▄▄░▌█▌███▐███░▀ s͛eͤaͣrͬcͨhͪ 
                    ▐░▐██░░▄▄▐▀█░░░▐▄█▀▌█▐███▐█             s͛eͤaͣrͬcͨhͪ
                    ░░███░▌▄█▌░░▀░░▀██░░▀██████▌                    s͛eͤaͣrͬcͨhͪ
                    ░░░▀█▌▀██▀░▄░░░░░░░░░███▐███                            рⷬaͣᴛⷮᴛⷮeͤrͬn foͦuͧndͩ
                    ░░░░██▌░░░░░░░░░░░░░▐███████▌                               success!
                    ░░░░███░░░░░▀█▀░░░░░▐██▐███▀▌
                    ░░░░▌█▌█▄░░░░░░░░░▄▄████▀░▀
                    ░░░░░░█▀██▄▄▄░▄▄▀▀▒█▀█░     regexes are crucial to finding patterns within your programs!
    
    🇮​​​​​🇳​​​​​ 🇴​​​​​🇷​​​​​🇩​​​​​🇪​​​​​🇷​​​​​ 🇹​​​​​🇴​​​​​ 🇫​​​​​🇱​​​​​🇾​​​​​ 🇮​​​​​🇳​​​​​ 🇦​​​​​🇷​​​​​🇮​​​​​🇦​​​​​ 🇦​​​​​🇮​​​​​🇷​​​​​🇱​​​​​🇮​​​​​🇳​​​​​🇪​​​​​🇸​​​​​ 🇾​​​​​🇴​​​​​🇺​​​​​ 🇲​​​​​🇺​​​​​🇸​​​​​🇹​​​​​ 🇭​​​​​🇦​​​​​🇻​​​​​🇪​​​​​ 🇦​​​​​ 🇷​​​​​🇪​​​​​🇬​​​​​🇮​​​​​🇸​​​​​🇹​​​​​🇪​​​​​🇷​​​​​🇪​​​​​🇩​​​​​ 🇸​​​​​🇪​​​​​🇷​​​​​🇮​​​​​🇦​​​​​🇱​​​​​ 🇳​​​​​🇺​​​​​🇲​​​​​🇧​​​​​🇪​​​​​🇷​​​​​ 🇹​​​​​🇴​​​​​ 🇧​​​​​🇴​​​​​🇦​​​​​🇷​​​​​🇩​​​​​         

The ARIA serial number regex pattern is responsible for the identification of the mircrochips that will be scanned at the
line of the airports and is the core way to check the database of a specific passenger, below are examples of what the serials 
would and should look like to staff.

x - - - - - - serials - - - - - - - x
ex. 5ghDts6gs424G82Gh7
ex. HSMD4247VVAH372421

The following examples above are just deepfake serials and are set in prime examples on how the serial numbers should be formatted.
🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂 🅶🅴🅽🅴🆂🅸🆂
'''

# default registered serial number file path 
serial_path = r'C:\Users\daint\Documents\GitHub\Scrap-Yard\Lab-Sketches-May-2023\contraptionregexserialnumberCKO7897\data\serialnumber.txt'

# ARiA serial number regex
aria_serial_number_regex = re.compile(r'^([0-9A-Za-zA-z\_\-]{18})$')

# TODO add more of explanation to this synopsis
'''  < - what are functions, call stacks? click here to find out! ♡〜٩( ╹▿╹ )۶〜♡ dude trust
                        
                        
                        -★                  █▀▀ █▀▀ █▄░█ █▀▀ █▀ █ █▀ █▀▀ █ █▀█                         -★
                                            █▄█ ██▄ █░▀█ ██▄ ▄█ █ ▄█ █▄█ █ █▀▄

                        ███████╗██╗░░░██╗███╗░░██╗░█████╗░████████╗██╗░█████╗░███╗░░██╗░██████╗  ██╗░░██╗
                        ██╔════╝██║░░░██║████╗░██║██╔══██╗╚══██╔══╝██║██╔══██╗████╗░██║██╔════╝  ╚██╗██╔╝
                        █████╗░░██║░░░██║██╔██╗██║██║░░╚═╝░░░██║░░░██║██║░░██║██╔██╗██║╚█████╗░  ░╚███╔╝░
                        ██╔══╝░░██║░░░██║██║╚████║██║░░██╗░░░██║░░░██║██║░░██║██║╚████║░╚═══██╗  ░██╔██╗░
                        ██║░░░░░╚██████╔╝██║░╚███║╚█████╔╝░░░██║░░░██║╚█████╔╝██║░╚███║██████╔╝  ██╔╝╚██╗
                        ╚═╝░░░░░░╚═════╝░╚═╝░░╚══╝░╚════╝░░░░╚═╝░░░╚═╝░╚════╝░╚═╝░░╚══╝╚═════╝░  ╚═╝░░╚═╝

                        ███╗░░░███╗███████╗████████╗██╗░░██╗░█████╗░██████╗░░██████╗
                        ████╗░████║██╔════╝╚══██╔══╝██║░░██║██╔══██╗██╔══██╗██╔════╝
                        ██╔████╔██║█████╗░░░░░██║░░░███████║██║░░██║██║░░██║╚█████╗░
                        ██║╚██╔╝██║██╔══╝░░░░░██║░░░██╔══██║██║░░██║██║░░██║░╚═══██╗
                        ██║░╚═╝░██║███████╗░░░██║░░░██║░░██║╚█████╔╝██████╔╝██████╔╝
                        ╚═╝░░░░░╚═╝╚══════╝░░░╚═╝░░░╚═╝░░╚═╝░╚════╝░╚═════╝░╚═════╝░
                        
    ★  sky is the limit    X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-x
                ★          |                 _______                         |    ^_< -★
                            |            _.-O:::::::::O::::\_                 |     _
                            |           /..:::-___ ::::.:::::\                |     \\ ^_< -★
                            |          |:..::::::::::::..::::;'               |    __\\___
    -★  regular expressions            |          |...|,|,,;;;,|,|..:::::'               |   `---..--' ^_< -★
                            |           ||..| _U  U_ |...:::;/                |      __\\___
                            |             \.|   .    |...:;/                  |     `---..--' ^_< -★
        ^_< -★  patterns    |              ``\_ . _ /;;::/                    |          \\
                            |           _.-'/\ `-'  |\ ''`--------.___        |           `' ^_< -★
                            |         _/  \ \.|\.--'|.| |/.           \_      |     _  _   _
                            |       _/    |.|:| |\  /./ :.        /     \     |     \\ \\ // ₊˚ʚ ᗢ₊˚✧ ﾟ.
                            |     _/      :. \:\`` |./  |___,----'--._   \    |      `  `//
                            |    /  __   .\.  \:\  /.|  /             \__=\   |      ___// ₊˚ʚ ᗢ₊˚✧ ﾟ.
                    ★       |   |.    `- /|.   \_\/_/  /                /  |  |     `---'
                            |   |.      `-;____  Q|:   '\               \;_/  |      _____ ₊˚ʚ ᗢ₊˚✧ ﾟ.__
                            |    \___     /    \  |__    \                    |     /,---- /
                   ★         |        `---|-_,,,' Q|       \                   |    //    // ₊˚ʚ ᗢ₊˚✧ ﾟ.
                            |           _|.       |     _/-`-._               |    `    //
                            |        ,-'. \__    /.\___/.\__  \`-.            |        // ^_< -★
    ★compile the pattern object    |      _/:.._/./.\__/. /.\. \   \.  \.\           |   ____//
                            |     /:. _/. /.  |.  |.  |. |.  \.  \_\          |   `---'      ^_< -★
                            |    /:. /.. |.  |.   |.  |. |.   \    \|         |       _  ^_< -★    
                            |   |:. /.. |.   |.   |.  |.   |.  \.  ||         |      |_|
            ★               |   |. /.. |.   |.    |.  |    |.   |. ./         |       ^_< -★ -★ -★ -★ -★ 
                            |   | |..  |.   |.    |.   |.   |.  |..|          |        ,.
                            |    \|.. |.   |..    |    |    |   |_/           |   _____||__ ʚ ᗢ₊˚
                            |     \.  |.   |.     |.   |.   |.  /             |   `----..--'
                            |      \_ /.   |.     |.   |.   |._/              |       /,|  ʚ ᗢ₊˚
                            |        \__.  |..    |.   |. __,/                |      //||
                            |           `----.___,--._,--'                    |     // ||         ʚ ᗢ₊˚ -★
                            |               \\===: |    |                     |    `'  `'ʚ ᗢ₊˚
                            |                `---' |    |                     |    _______  
                            |                      |    |                     |   `------.|
                            |                      | __ |                     |          ||
                            |                      |'  :'                     |          //
                            |                ......|   |......                |         //
                            |            .....:.:. |   |.:........            |    ____//
                            |          ...:..:.:.. |   |..:...:.....          |    `---'
                            |        ...:......... |_  |.:.:..........        |         -★
                            |       ..:...:.:.... /==\-|..:.:..:.:.....       |
                            |       .....:.....:. \===\|.:.:...........       |
                            |       .......:...... |===/..:...:....:.:.       |
                            |        :.......:.... |==/ .:............        |
                            |          ..:.........`--'.......genesis...      |
                            |            .......:.......:.~                   |
                            |                 ..........                      |
                            
                            
                            
                                            -𝚐𝚎𝚗𝚎𝚜𝚒𝚜 𝚜𝚢𝚗𝚘𝚙𝚜𝚒𝚜-
                                            
functions allow you to recycle code and use them again within your programs, they are like mini programs that allow the usages of
𝗽𝗿𝗲𝘃𝗶𝗼𝘂𝘀 syntax that where meant for a certain mechanic within the module and can give an advantage to your programs in the long run

use them as much as you can they can be used with optional params and be named anything as long they are name formatted pythonically correct
and these parameters take arguments when the function calls are called and the function is ran. call stack comes into play as well and understanding 
it will help you better grasp a idea on how they work. The way the program execution traverses through the script with functions uses a call stack


█▀▀ █░█ █▄░█ █▀▀ ▀█▀ █ █▀█ █▄░█   █▀▀ ▄▀█ █░░ █░░   █▀ ▀█▀ ▄▀█ █▀▀ █▄▀   █░░ █▀█ █▀▀ █ █▀▀
█▀░ █▄█ █░▀█ █▄▄ ░█░ █ █▄█ █░▀█   █▄▄ █▀█ █▄▄ █▄▄   ▄█ ░█░ █▀█ █▄▄ █░█   █▄▄ █▄█ █▄█ █ █▄▄

Let's take the following diagram as a way to analze this logic

ex. 1-1

conversation index
𝗔 - PC method
𝗕 - winter disaster method
𝘾 - GPU method


                - [ 𝘾 ]    
        [ 𝗕 ] - [ 𝗕 ]  - [ 𝗕 ]        - [ 𝗕 ]
[ 𝗔 ] - [ 𝗔 ] - [ 𝗔 ] - [ 𝗔 ] - [ 𝗔 ] - [ 𝗔 ] - [ 𝗔 ] - [all methods have finished]

the exampple above represents how the program execution traverses through the program with functions, like a conversation you have daily a call stack 
is the same in a way if you were having a talk about PC's , lets say the whole conversation about it was stored in the function 'A' which was abunch
of print() methods telling a story and each method was the same concept but with different stories. The call stack works in a very efficiant way,
it will return to the function call that first called it. firstly let's understand how calls work they are the core way how to execute methods

'''

# define methods

def __serial_match_results__(regex_group_int: int = 1):
    ''' # __serial_match_results__() method
    display the results to the serial number matches found with the 'aria_serial_number_regex' within the main module
    
    ex. serial number found in microchip
    ARIA serial: [HSMD4247VVAH372421]
    '''
    
    # global
    global match_found
    
    # serial number was traced!
    print('serial number found in microchip \nARIA serial: [%s] \n' %(mo.group(regex_group_int)))
    return print('''NOTICE: Save this serial to a note or write this down for the future DO NOT lose this you will have to purchase another one
    from the ARIA airport website www.ariaairlines.com/store/purchaseserialpage.
        ''')

def aria_document_file_search(default_filepath: str = serial_path): # I/O
    
    # flow control for filepath location prompt user
    while True:

        def openfile(filepath: str = serial_path):
            # import module in local (scope)
            import re
            
            # globals
            global contents, mo, match_found
            
            # var
            match_found = None
            
            # filepath const
            filepath =  default_filepath
            
            
            # open file with user designated filepath
            with open(file=filepath , mode='r') as f:

                # store file within constant
                contents = f.read()
                
                # scan contents for regexes
                mo = aria_serial_number_regex.search(contents)
                
                # match object conditional
                if mo == str: # match found
                    # set match object discovered status to a boolean value 'True'
                    match_found = True
                    
                elif mo == None: # match not found
                    match_found = None
                
                else:
                    pass
        
        # prompt user for filepath serial number locale
        print('Please enter the filepath to the file where your serial number is located on your PC')
        
        # retrieve usersinput on filepath to serial
        resp = input('or press [enter] to automatically load the default filepath with your registered serial >>>')
        return openfile(resp)

def search_serial_code():
    """ # search_serial_code() method
    A function that will search a file or users input for their purchased ARIA serial number indentification number
    """

    # refer to global (scopes)
    global mo
    
    # match obj
    mo = aria_serial_number_regex.search(contents)
    
    # exception handling for serial
    try: # check for exception
        
        __serial_match_results__() # display matches found
    
    except: # write code to fix exception
        
        # serial not found display message top stdout
        print('''EXCEPTION404: The serial number was not found on the device , consult to ARIA staff or manager on site about the missing 
informations. \n''')
    
    finally: # code final output
        

        if match_found == True:
            pass
        elif match_found != None:
            __serial_match_results__() # display shit
        else:
            pass

# calls
aria_document_file_search() # user provides serial path or open file containing serial number
search_serial_code()