'''
🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 


                                            █▀▀ █▀▀ █▄░█ █▀▀ █▀ █ █▀ █▀▀ █ █▀█
                                            █▄█ ██▄ █░▀█ ██▄ ▄█ █ ▄█ █▄█ █ █▀▄
                                            
                                            █▀█ █▀▀ █▀█ █▀▄▀█ █░█ ▀█▀ ▄▀█ ▀█▀ █ █▀█ █▄░█ █▀
                                            █▀▀ ██▄ █▀▄ █░▀░█ █▄█ ░█░ █▀█ ░█░ █ █▄█ █░▀█ ▄█
                                            𝘀𝗼𝘂𝗿𝗰𝗲 𝗯𝘆 𝗴𝗲𝗻𝗲𝘀𝗶𝘀𝗴𝗶𝗿⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⢀⣠⠤⣶⣶⣤⣀⡀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣠⠟⢦⣤⡄⠒⠋⠁⠀⠀⢻⡝⢧⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⢿⡏⠀⢀⡀⠀⠀⠀⠀⠀⢷⢸⡇
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀⠘⠃⠀⠀⠀⠀⠀⣸⣸⠃
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⠃⠁⠉⢳⣴⢻⣽⣟⢦⠘⠃⠀⠀⠀⠀⠀⠀⠀⢀⡿⠃⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠁⠀⠀⠀⠋⠐⠉⠙⣿⢿⡇⠀⠀⣀⡀⠀⠀⢀⡴⣿⠃⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢾⣄⠀⠀⠀⠀⠀⣰⠟⣽⠁⠀⣀⠓⠃⠀⢠⡞⣱⠃⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣾⣿⣧⣦⣤⣤⡔⢋⠈⠁⠀⠀⠀⠀⠀⠀⠏⡼⠃⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠶⠀⠀⠀⢸⣻⣿⣿⣯⠟⠋⠀⠀⠀⠀⠀⠀⠀⣠⠞⠁⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⣞⣳⠀⠀⠀⠀⠀⠙⠛⠉⠀⠀⠀⢠⡀⢠⡄⠀⢀⡾⡯⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⢀⣇⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⣡⡾⢋⡼⠃⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠄⠉⣠⠞⠁⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠰⣄⣸⢸⢠⡆⠀⠀⠀⠀⠀⠰⠞⠁⠰⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⣀⣀⣠⡽⠛⠘⢿⣥⣤⣤⣤⣀⠀⠤⠠⢤⢤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⣠⠶⣿⡛⠁⠀⠉⠉⠉⠙⣿⣦⢠⣰⠚⣋⣉⣁⣀⣤⠤⣶⣫⡤⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⠈⠓⠚⠿⠯⠭⠭⠭⠤⠼⠏⢹⢾⠿⠿⠟⠓⠒⠚⠋⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠀⢸⣼⠀⠀⠀⠸⠿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⢀⡄⢠⡏⠀⠘⣿⠀⠀⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⢀⡞⣤⠏⠀⠀⠀⡿⠀⠀⠀⢴⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⣾⡾⠃⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⣸⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡤⡶⡦⢤⣀⡴⠋⣥⣍⡻⡄⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⢠⢿⠀⠠⣶⠀⠀⠀⠀⠀⠀⠀⠀⢀⡞⣥⣾⣷⣷⣶⡝⠂⠈⠀⠘⠓⢻⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⢸⠘⣆⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⢸⣸⣿⣿⠟⠁⠀⠀⠀⠀⠀⠀⣔⢸⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠘⣆⠹⣆⠀⢠⡆⠀⢀⡀⠈⠁⠀⢸⠐⣿⣿⡀⠀⠀⠀⠀⢀⢠⣶⣟⠟⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠘⠫⢘⢧⣼⣷⣂⡈⠉⠀⢀⣀⡌⢧⠻⣿⣷⡀⠀⠀⠀⠨⣿⣿⠁⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠉⢉⣿⡟⠿⠥⣶⣟⣉⣁⣠⡤⠴⠖⠙⠟⣴⣀⠀⣽⡿⣳⠇⠀⠀⠀⠀⠀⠀⠀all variations of a members sequence
                                        ⠀⠀⠀⠀⠀⠀⡴⠃⠘⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠓⠦⢤⣈⣨⡴⠋⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⢈⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
                                        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀

𝓰ⲉⲛⲉ𝛓ⲓ𝛓 𝛓ⲩⲛⲟⲣ𝛓ⲓ𝛓
permutation is the arrangement of a sequences of members and is the re-arrangement of how the elements, values, members are ordered and all variations/permutations 
of that seqeunce are returned. This is very an important practice to learn within programming and permutation is a must know skillset every programmer should have
you ill have the ability of returning and obtaining all variations of a sequence and to view them. permutation is also in mathematics as well and goes
to show the importance of this method, In theory you could make a simple code-lock unlocker that uses permutation to find all the possible variations 
perms with a given set, Lets say the code-lock has only the numbers 1, 2, 3 on the pad you could use permutation and find out every match/mutation with these
integers using the method..wink.. code safely everyone.

𝐞𝐱𝐚𝐦𝐩𝐥𝐞 1-1

# module import
from itertools import permutations

perm = permutations([1, 2, 3])

for e in perm:
    print(e)

# output

(1, 2, 3)
(1, 3, 2)
(2, 1, 3)
(2, 3, 1)
(3, 1, 2)
(3, 2, 1)

As you can see the function permutations() used on a list containing the following integers has returned the re-arranged/mutated list with all possible
variations/permutations with the members provided making permutation a key skill to add to your coding mind and arsenal and should be learned.

🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁 🅶🅴🅽🅴🆂🅸🆂🅶🅸🆁
'''

# import module
from itertools import permutations
from typing import Type # return types


# array
sets = [] # <- default sets


# method
def perm() -> Type[None]:
    # refer to global var
    global sets
    
    # data set to order
    dataset = permutations(['1', '2', '3'])

    # iterate through values
    for e in dataset:

        # join items together
        codepattern = ''.join(e)
        
        # append items to sets[]
        sets.append(str(codepattern))
        
        # display sets
        print(codepattern)
    return None


def softcorp() -> Type[str]:
    # info accessed
    return print('company details accessed! \n')


def __unlock_pass_code__():
    
    # hardcoded passcode of copmany
    PASS_CODE = '231'

    # codes to test run
    code = sets[0:]

    # conditional for testing out different sets to hack in
    if PASS_CODE in code:
        return softcorp()
    else:
        pass


perm() # store items and display all orders
__unlock_pass_code__() # unlock codelock